{"pages":[{"title":"About","text":"Hello guys, ini adalah halaman blogku. yang nantinya semua pengalamanku akan aku tulis di sini. yang pasti aku berusaha semaksimal mungkin share ilmu melalui media ini. Ooo iya, kenalan dulu dong. Namaku ainun abdullah, temen - temenku biasa manggil aku ainun… asalku dari kota gresik, lebih tepatnya di desa sekargadung, kec dukun, kab gresik. sebuah desa yang jauh dari keramaian, karena desa ini terletak diantara sawah dan belantaran sungai bengawan solo. Saat artikel ini di buat. aku sedang menempuh pendidikan D4 Di Politeknik Elektronika Negeri Surabaya(PENS). dan sedang berjuang untuk meyelesaikan Tugas Akhir ku… agar dapat lulus di kampus tercinta ini. hehe :( jadii… tunggu aja yaa. potingan2 artikel ku berikutnya.. see U","link":"/about/index.html"},{"title":"Categories","text":"","link":"/categories/index.html"},{"title":"Curriculum Vitae ","text":"Download My ProfileI am an Informatics Engineering Student from PENS who have a good interest in IT Infrastructure and Application Development as good prospect in the future. With my four years college experience, I able to work in a team with a great teamwork, also able to work under pressure. In college I also do IT project and active in my technology community Areas of ExpertiseNew Technology Enthusiasts, Network Computer Administration, DevOps, Network Security, Linux Server lovers, Big Data Platform, Website Development, Programming,language experience,Machine Learning IT PROJECTS AND EXPERIENCES Healthy History Information System Payroll Information management System Savings management website based Maintenance an RTRW-net Building general linux server Final ProjectsDNS TRAFFIC ANALYSIS OF INDONESIA CCLTDMy final project is about analysis of traffic DNS in Indonesia ccTLD. there are two process in this research, firstly how to get features to detect malicious or benign traffic in DNS. and secondly how to building good environment to process the data. in this research i use bro network security monitor as data extractor DNS traffic and processing the data with decision tree algorithm to detect malicious or benign traffic. and all of the process is running on the big data environment that design and built by me. in big data design environment i use kafka, spark, hadoop and mongoDB to get good performance for this case Organitations Chief of open source community pens - 2016 OSC or the open source community in PENS is a technology organization in the field of informatics engineering that discusses the latest open source technology. usually this community meets every week to discuss the material to be discussed. there are many topics that are raised, including basic to advanced Linux operating systems, computer networks, programming and tools that are being used for application development. and in here i trusted as a chief in 2016-2017 periode PSDM staff of Unit UKKI - 2016 until 2017 beside in OSC i also join the UKKI organizations. UKKI is an muslim organization to share the knowledge of islam. and alhamdulillah in UKKI i trusted in development of human resources or PSDM.","link":"/cv/index.html"},{"title":"Portofolio","text":"Personal Project Healthy History Information System Payroll Information management System Savings management website based Maintenance an RTRW-net Building general linux server Professional Project Managing Infrastructur and develop frontend view at umrahaj.id Managing Infrastructur and develop frontend view at solusitax.com Freelance Developer at pointhc.com","link":"/portofolio/index.html"},{"title":"Tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"Sapaan dari yang punya blog :(","text":"Hello guys, ini adalah halaman blogku. yang nantinya semua pengalamanku akan aku tulis di sini. yang pasti aku berusaha semaksimal mungkin share ilmu melalui media ini. Ooo iya, kenalan dulu dong. Namaku ainun abdullah, temen - temenku biasa manggil aku ainun… asalku dari kota gresik, lebih tepatnya di desa sekargadung, kec dukun, kab gresik. sebuah desa yang jauh dari keramaian, karena desa ini terletak diantara sawah dan belantaran sungai bengawan solo. Saat artikel ini di buat. aku sedang menempuh pendidikan D4 Di Politeknik Elektronika Negeri Surabaya(PENS). dan sedang berjuang untuk meyelesaikan Tugas Akhir ku… agar dapat lulus di kampus tercinta ini. hehe :( jadii… tunggu aja yaa. potingan2 artikel ku berikutnya.. see U","link":"/2018/12/18/Binggung-mau-nulis-apa/"},{"title":"Cara download file di google drive dengan command line di linux","text":"Hello guys, Assalamulaikum wr wb. gimana kabar kalian hari ini. Tentunya senang sekali yaaa. karena masih bisa mentengin blog ini… Pada kesempatan kali ini, aku pengen berbagi tips atau tutorial agar bisa download file di google drive. caranya mudah banget, yaitu dengan menggunakan tools yang aku temukan di github. berikut linknya. https://github.com/prasmussen/gdrive.untuk lebih jelasnya berikut langkah - langkahnya Download the binary. Choose the one that fits your architecture, for example gdrive-linux-x64. Copy it to your path. 12sudo cp gdrive-linux-x64 /usr/local/bin/gdrive;sudo chmod a+x /usr/local/bin/gdrive; setelah itu, jalankan gdrive download id-url","link":"/2018/12/26/Cara-download-file-di-google-drive-dengan-command-line-di-linux/"},{"title":"Git Submodule Tutorial","text":"IntroductionIn our Git projects, sometimes we will include and use other Git projects as submodules. One easy and reproducible way to do this is simply to clone the other Git projects and copy the Git projects in the directories under our own projects. However, it is also likely that the project we are working on has close relationships or collaboration with the submodule Git projects, and we want the submodules to be always up-to-date. In this way, we will use git submodule functions to manage submodules. In this short blog post, I will talk about the basic protocols of using git submodule correctly in our projects in practice. For more comprehensive usages, please go to the reference section. TutorialCreate Submodules in Our Own Git ProjectsWe will use git submodule add to create submodules in our own Git projects. 1$ git submodule add [-b &lt;branch&gt;] [-f|--force] [--name &lt;name&gt;] [--reference &lt;repository&gt;] [--depth &lt;depth&gt;] [--] &lt;repository&gt; [&lt;path&gt;] For example, if we want to use TensorFlow project branch r1.14 as our submodule in directory third_party/tensorflow. In our Git project git-submodule-demo, we run the following commands. 123456$ cd git-submodule-demo/# Empty demo project.$ ls -a. .. .git# Create TensorFlow submodule.$ git submodule add -b r1.14 https://github.com/tensorflow/tensorflow.git third_party/tensorflow We then check what submodule information has been added. 123456789101112131415161718192021222324252627282930$ ls -a. .. .git .gitmodules third_party# We got TensorFlow as our submodule.$ ls -a third_party/tensorflow/. BUILD .github RELEASE.md.. CODE_OF_CONDUCT.md .gitignore SECURITY.mdACKNOWLEDGMENTS CODEOWNERS ISSUES.md tensorflowADOPTERS.md configure ISSUE_TEMPLATE.md third_partyarm_compiler.BUILD configure.py LICENSE toolsAUTHORS CONTRIBUTING.md models.BUILD WORKSPACE# We will have a `module` directory in the `.git` directory for the submodules$ ls -a .git/. branches description hooks info objects.. config HEAD index modules refs# The `.git` directory for the TensorFlow submodule$ ls -a .git/modules/third_party/tensorflow/. branches description hooks info objects refs.. config HEAD index logs packed-refs# The TensorFlow submodule information was added to `.git/config`$ cat .git/config ...[Git Information Skipped]...[submodule \"third_party/tensorflow\"] url = https://github.com/tensorflow/tensorflow.git active = true# The TensorFlow submodule information was added to `.gitmodules`$ cat .gitmodules [submodule \"third_party/tensorflow\"] path = third_party/tensorflow url = https://github.com/tensorflow/tensorflow.git branch = r1.14 We then push the changes to GitLab or GitHub. 123$ git add .$ git commit -m \"add submodule\"$ git push origin master On GitLab or GitHub, there will be symbolic links to the Git projects for the submodules. Remove Submodules in Our Own Git ProjectsIt used to be very tricky to remove the Git submodules. However, the latest protocol for the new versions of Git makes the life easier. To remove the TensorFlow submodule we just added. 123$ git submodule deinit -f third_party/tensorflow/$ rm -rf .git/modules/third_party/tensorflow/$ git rm -f third_party/tensorflow/ We then check if the submodules have been totally removed. 12345678910$ ls -a. .. .git .gitmodules third_party# No TensorFlow submodule anymore in `third_party`.$ ls -a third_party/. ..# No TensorFlow submodule anymore in `.git/modules/third_party/`.$ ls -a .git/modules/third_party/. ..# No TensorFlow submodule anymore in `.gitmodules`.$ cat .gitmodules Once the submodules were removed, we could add the exact same submodules. 1$ git submodule add -b r1.14 https://github.com/tensorflow/tensorflow.git third_party/tensorflow If the submodules were not removed in a clean way and there are residual information left, there will be problems to add the exact same submodules. Works with Submodules in Other Git ProjectsSometimes we would have to work on Git projects from others which contains submodules. After git clone, we actually would not have the submodules cloned. 12345678910111213141516171819$ cd git-submodule-demo/$ ls -a. .. .git .gitmodules third_party# The submodule information is `.gitmodules `$ cat .gitmodules [submodule \"third_party/tensorflow\"] path = third_party/tensorflow url = https://github.com/tensorflow/tensorflow.git branch = r1.14# The submodule directory is empty.$ ls -a third_party/tensorflow/. ..# There is no `module` directory to store the `.git` files for submodules.$ ls -a .git. branches description hooks info objects refs.. config HEAD index logs packed-refs$ cat .git/config ...[Git Information Skipped]...[No submodule information] To retrieve the submodules, we have to run the following command. 1234567891011# Git submodule would use the submodule information in the `.gitmodules` to retrieve the submodules.$ git submodule update --init --recursive# The TensorFlow submodule was retrieved.$ ls -a third_party/tensorflow/. BUILD .github RELEASE.md.. CODE_OF_CONDUCT.md .gitignore SECURITY.mdACKNOWLEDGMENTS CODEOWNERS ISSUES.md tensorflowADOPTERS.md configure ISSUE_TEMPLATE.md third_partyarm_compiler.BUILD configure.py LICENSE toolsAUTHORS CONTRIBUTING.md models.BUILD WORKSPACE.bazelrc .git README.md Sometimes we want to create submodules that are exactly used in other Git projects for our own projects. We just have to check the submodule information in the .gitmodules file, and used the method we described in “Create Submodules in Our Own Git Projects” to create those submodules accordingly. Final RemarksWe have to be careful when we use git submodule because the submodules might be updated without sending notifications to you and all your dependencies might break. References Git Submodule Documentation Git Tool - Submodules Git Submodule Removal","link":"/2019/12/01/Git-Submodule-Tutorial/"},{"title":"Hack RDP windows dengan RDPWrap","text":"windows adalah salah satu sistem operasi yang banyak digunakan saat ini, terutama untuk keperluan perkantoran maupun yang lain. salah satu fitur yang banyak digunakan pada jaringan lokal maupun public adalah remote desktop protokol (rdp). yang mana dapat digunakan untuk remote sistem operasi windows dari jaringan.namun, pada windows biasa(pro, home, education, dll) tidak dapat digunakan rdp secara multiremote. atau bisa dibilang 1 os windows tersebut hanya bisa di remote oleh 1 user dalam satu waktu. nah, di sini saya ingin berbagi bagaimana caranya agar windows kita dapat digunakan remote desktop dengan multiuser. beberapa bulan yang lalu saya menemukan aplikasi bernama rdpwrap yang dapat digunakan untuk mengatasi hal tersebut. download aplikasi di https://github.com/stascorp/rdpwrap/releases pilih format .msi atau .zip kemudian install aplikasi tersebut, dengan cara klik 2x install.bat check apakah aplikasi sudah terpasang atau belum dengan menjalankan RDPcheck.exe restart windows anda cobalah konek ke windows anda dengan multiuser via rdp","link":"/2018/12/18/Hack-RDP-windows-dengan-RDPWrapper/"},{"title":"Docker and iptables","text":"Di Linux, Docker memanipulasi rules iptables untuk menyediakan isolasi jaringan atau control access. Menambahkan policies sebelum docker rulesSecara default, semua ip dari luar di izinkan terhubung ke docker domain. jika hanya ingin menginzinkan ip tertentu yang dapat mengakses container, perlu di tambahkan rule pada docker filter paling atas. aturan berikut membatasi akses dari luat ke semua ip address kecuali 192.168.1.11$ iptables -I DOCKER-USER -i ext_if ! -s 192.168.1.1 -j DROP ext_if diatas adalah nama interface yang terdapat pada host. jika ingin memodifikasi rule diatas menjadi subnet. maka rule yang digunakan menjadi seperti ini: 1$ iptables -I DOCKER-USER -i ext_if ! -s 192.168.1.0/24 -j DROP iptables juga dapat digunakan untuk mengatur berdasarkan range ip seperti ini: 1$ iptables -I DOCKER-USER -m iprange -i ext_if ! --src-range 192.168.1.1-192.168.1.3 -j DROP Source : https://docs.docker.com/network/iptables/","link":"/2019/12/01/How-to-install-Docker/"},{"title":"How to install Docker in Ubuntu 18.04","text":"Untuk menginstall docker pada ubuntu 18.04, ikuti urutan perintah di bawah ini: Update repository list 1sudo apt update Install packgae requirements 1sudo apt install apt-transport-https ca-certificates curl software-properties-common -y3. Add repository docker to system 123curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -sudo add-apt-repository \"deb [arch=amd64] https://download.docker.com/linux/ubuntu bionic stable\"sudo apt update Check docker found in our repository or yet 1apt-cache policy docker-ce Install docker 1sudo apt install docker-ce -y Check docker status 1sudo systemctl status docker Add our user to docker group 12sudo usermod -aG docker ${USER}sudo usermod -aG docker username","link":"/2019/12/11/Introduce-Docker/"},{"title":"Port Forwarding with iptables","text":"Assalamu’alaikum wr wb guys, di malam pergantian tahun 2018 ke 2019 ini aku mau share ilmu tentang port forwarding pada sistem operasi linux.. Apa itu Port Forwarding ? Jadi gini guys, Port forwarding memungkinkan komputer yang jauh untuk terhubung dengan komputer atau layanan tertentu di jaringan wilayah lokal (LAN) pribadi. Untuk koneksi yang lebih cepat, beberapa aplikasi P2P (seperti BitTorrent) mungkin juga memerlukan pengaturan Port Forwarding. Anda dapat membuka beberapa port atau jangkauan port dalam router, dan mengalihkan data melalui port tersebut ke satu klien dalam jaringan Anda. Ketika menkonfigurasi port forwarding, administrator jaringan menyisihkan satu nomor port komunikasi pada gateway untuk penggunaan khusus berkomunikasi dengan layanan di jaringan internal, host external harus tahu nomor port ini dan alamat gateway untuk berkomunikasi dengan layanan jaringan internal. Nomor port yang seringkali digunakan adalah nomor port 80 untuk layanan web (HTTP) pada port forwarding, sehingga layanan jaringan lokal juga dapat digunakan oleh host jaringan luar. nah kali ini, kita akan mencoba menggunakan port forwarding pada sistem operasi linux dan iptables. iptables yaitu aplikasi berbasis linux yang digunakan untuk firewall. firewall di sini digunakan untuk mengatur paket yang boleh masuk dan keluar dari sistem. berikut adalah contoh kita mengarahkan port 27017 ke komputer public di arahkan ke ip 192.168.0.67 dan port 27015 enable ip forwarding 1# echo 1 &gt; /proc/sys/net/ipv4/ip_forward membuat port role redirection 12# iptables -t nat -A PREROUTING -p tcp --dport 27017 \\ -j DNAT --to-destination 192.168.0.69:27015 membaut rule masquerade pada paket yang di kembalikan 1iptables -t nat -A POSTROUTING -p tcp --dport 27015 -j MASQUERADE","link":"/2018/12/31/Port-Forwarding-with-iptables/"},{"title":"Cara berkomunikasi pada ssh tanpa password","text":"Apa itu ssh ? Menurut wikipedia : “Secure Shell (SSH) is a cryptographic network protocol for operating network services securely over an unsecured network.” Jadi kalo saya terjemahkan secara bebas ssh Secure Shell (SSH) adalah protokol jaringan kriptografi untuk mengoperasikan layanan jaringan secara aman melalui jaringan yang tidak amanatau kalo temen2 yang sudah biasa di dunia IT biasanya digunakan untuk remote server yang berbasis linux. Biasanya kalo kita ingin akses linux via ssh. pasti menggunakan password atau certificate key. nah kali ini saya ingin berbagi gimana caranya akses server tanpa menggunakan 2 hal tadi. yang mana cara ini biasa digunakan bila agan2 ingin menggunakan ssh untuk mengirimkan perintah tertentu. langsung saja. silahkan ikuti langkah2 berikut : generate ssh public key pada komputer anda 1ssh-keygen -b 4096 untuk mengenerate public key, kita dapat menggunakan ssh-keygen. dengan menggunakan perintah seperti di atas. setelah itu tekan enter maka akan keluar console dialog seperti di bawah ini. silahkan kosongi dan tekan enter saja. sampai proses selesai 12345678Generating public/private rsa key pair. Enter file in which to save the key (/home/user/.ssh/id_rsa): Enter passphrase (empty for no passphrase): Enter same passphrase again: Your identification has been saved in /home/user/.ssh/id_rsa. Your public key has been saved in /home/user/.ssh/id_rsa.pub. The key fingerprint is: f6:61:a8:27:35:cf:4c:6d:13:22:70:cf:4c:c8:a0:23 user@linode Upload public key kita ke server Masuk sebagai user yang ingin menggunakan key pair 1ssh user@example.com buat .ssh dan file authorized_keys untuk menyimpan key kita12mkdir ~/.ssh &amp;&amp; touch ~/.ssh/authorized_keyschmod 700 ~/.ssh &amp;&amp; chmod 600 ~/.ssh/authorized_keys kemudian pada mesin local kita, gunakan scp untuk mengcopy file public key di local ke server 1scp ~/.ssh/id_rsa.pub example_user@203.0.113.10:~/.ssh/authorized_keys waktunya pengecekansilahkan ssh server anda dengan perintah berikut dan lihat hasilnya… 1ssh user@example.com","link":"/2018/12/18/cara-berkomunikasi-tanpa-password/"},{"title":"laporan footprinting","text":"laporan footprinting Praktikum Keamanan Jaringan (Tugas 1)identitas mahasiswa Nama = Ainun Abdullah NRP = 2110151049 Kelas = 4 D4 IT B MatKul = Praktikum Keamanan jaringan Dosen = Dr. Idris Winarno. S.ST, M.Kom contentPada praktikum kali ini saya melakukan footprinting dengan tools nslookup dan whoisnslookup adalah suatu tool untuk melihat query DNS Server yg digunakan dan juga untuk melihat IP Address suatu domain maupun sebaliknya contoh penggunaan nslookup pada percobaan ini adalah nslookup www.infoglobal.co.id 12345678910111213141516root@ubuntu-s-1vcpu-1gb-sgp1-01:~# nslookup infoglobal.co.idServer: 67.207.67.2Address: 67.207.67.2#53Non-authoritative answer:Name: infoglobal.co.idAddress: 117.102.76.180Server: 67.207.67.2Address: 67.207.67.2#53Non-authoritative answer:Name: infoglobal.co.idAddress: 117.102.76.180# whois infoglobal.co.id pada percobaan diatas, setelah kita melakukan nslookup pada domain tujuan. nslookup akan memberikan jawaban berupa ip 117.102.76.180 dari domain infoglobal.co.id yang menjadi objek percobaan. untuk melakukan mengetahui informasi lebih lanjut tentang domain infoglobal.co.id saya menggunakan tools whois. adapaun kegunaan whois adalah sebagai berikut : Mendukung keamanan dan kestabilan dari internet dengan menyediakan informasi kontak yang bisa dihubungi yang berhubungan dengan jaringan, ISP, dan pemilik domain. Untuk mendapatkan informasi ketersediaan domain. Sehingga jika domain tersedia dalam artian belum diregistrasi oleh orang lain, maka Anda bisa melakukan registrasi atas nama domain tersebut. Mempermudah penegakan hukum dalam investigasi pelanggaran hukum dalam suatu negara, seperti terorisme, pornografi, perdagangan organ, dan illegal content. Memfasilitasi pencarian data untuk hak cipta dan merk dagang Memberikan kontribusi pada kepercayaan pengunjung ketika mengunjungi suatu situs, seperti situs ecommerce ( toko online ), lembaga sosial, atau perusahaan yang menawarkan produk jasa. baik. langsung saja. kita coba menggunakan perintah whois dengan perintah berikut ini. 1root@ubuntu-s-1vcpu-1gb-sgp1-01:~# whois 117.102.76.180 output dari perintah di atas akan menampilkan beberapa informasi mengenai ip tersebut.1234567891011121314151617181920212223242526272829303132333435363738394041424344454647484950515253545556575859606162636465666768697071727374757677787980818283848586878889909192% [whois.apnic.net]% Whois data copyright terms http://www.apnic.net/db/dbcopyright.html% Information related to &apos;117.102.64.0 - 117.102.127.255&apos;% Abuse contact for &apos;117.102.64.0 - 117.102.127.255&apos; is &apos;abuse@biz.net.id&apos;inetnum: 117.102.64.0 - 117.102.127.255netname: BIZNET-IDdescr: Biznet ISPdescr: Internet Service Providerdescr: Jakarta, Indonesiacountry: IDadmin-c: AA590-APtech-c: AA590-APremarks: Send SApam &amp; Abuse report to: abuse@biz.net.idstatus: ALLOCATED PORTABLEmnt-by: MNT-APJII-IDmnt-lower: MAINT-ID-BIZNETmnt-irt: IRT-BIZNET-IDlast-modified: 2011-02-07T07:49:09Zsource: APNICirt: IRT-BIZNET-IDaddress: Biznet Networksaddress: Midplaza 2, 8th Flooraddress: Jl. Jend Sudirman Kav 10-11address: Jakarta 10220e-mail: agus_ariyanto@biz.net.idabuse-mailbox: abuse@biz.net.idadmin-c: AA590-APtech-c: AA590-APauth: # Filteredmnt-by: MAINT-ID-BIZNETlast-modified: 2018-05-31T22:29:06Zsource: APNICperson: Agus Ariyantonic-hdl: AA590-APe-mail: agus_ariyanto@biz.net.idaddress: Midplaza 2, 8th Flooraddress: Jl. Jend Sudirman Kav 10-11address: Jakarta, Indonesiaphone: +62-21-57998888fax-no: +62-21-5700580country: IDmnt-by: MAINT-ID-BIZNETlast-modified: 2008-09-04T07:54:14Zsource: APNIC% Information related to &apos;117.102.76.176 - 117.102.76.183&apos;inetnum: 117.102.76.176 - 117.102.76.183netname: BIZNET-PT-InfoGlobal-Teknologi-Semesta-BLOCKcountry: IDdescr: PT InfoGlobal Teknologi Semesta - Surabayaadmin-c: AA590-APtech-c: AA590-APmnt-irt: IRT-BIZNET-IDstatus: ASSIGNED NON-PORTABLEmnt-by: MAINT-ID-BIZNETlast-modified: 2017-10-21T00:44:02Zsource: IDNICirt: IRT-BIZNET-IDaddress: Biznet Networksaddress: Midplaza 2, 8th Flooraddress: Jl. Jend Sudirman Kav 10-11address: Jakarta 10220e-mail: agus_ariyanto@biz.net.idabuse-mailbox: abuse@biz.net.idadmin-c: AA590-APtech-c: AA590-APauth: # Filteredmnt-by: MAINT-ID-BIZNETlast-modified: 2017-10-24T02:31:22Zsource: IDNICperson: Agus Ariyantonic-hdl: AA590-APe-mail: agus_ariyanto@biz.net.idaddress: Midplaza 2, 8th Flooraddress: Jl. Jend Sudirman Kav 10-11address: Jakarta, Indonesiaphone: +62-21-57998888fax-no: +62-21-5700580country: IDmnt-by: MAINT-ID-BIZNETlast-modified: 2008-09-04T07:54:14Zsource: IDNIC% This query was served by the APNIC Whois Service version 1.88.15-46 (WHOIS-JP3) dari banyaknya informasi di atas. ada beberapa hal dapat kita simpulkan seperti berikut : domain infoglobal.co.id memiliki ip 117.102.76.180 informasi whois di atas di ambil dari registra APNIC ISP yang digunakan adalah Biznet ISP Negara bagian ip tersebut terletak di Indonesia Domain ini Dibuat pada tahun 2008 Nama Perusahaan yang mempunyai domain ini adalah PT InfoGlobal Teknologi Semesta - Surabaya Orang Yang bertanggung jawab dari pihak Biznet adalah Agus Ariyanto dll Download PDF disini","link":"/2018/08/30/footprinting/"},{"title":"instalasi ansible","text":"Ansible merupakan automation tool untuk manage banyak remote hosts dari single machine. kali ini aku mau sharing tentang contoh sederhana penerapan tool yang satu ini.. check this out... konfigurasi akses sshpertama adalah generate ssh keygen pada ansible server 1$ ssh-keygen kemudian copy public ssh key ke semua remote hosts yang terhubung melalui ssh 12$ ssh-copy-id -i ~/.ssh/id_rsa.pub samdon@host1$ ssh-copy-id -i ~/.ssh/id_rsa.pub samdon@host2 instalasi ansible pada ubuntu 16.04 123$ sudo apt-add-repository ppa:ansible/ansible$ sudo apt update$ sudo apt install ansible pada step ini, ansible server telah terinstall. untuk mengeceknya bisa menggunakan perintah berikut : 1$ ansible --version konfigurasi hosts dan groups/etc/ansible/hosts merupakan file yang digunakan untuk mengatur host yang terhubung pada server ansible. untuk mengeditnya dapat menggunakan perintah berikut ini : 1$ sudo nano /etc/ansible/hosts kemudian sebagai contoh host dapat diatur dalam group-group yang diinginkan seperti berikut : 123456[webservers]web-host1web-host2[dbservers]db-host1 test ansible setup 1$ ansible -m ping all 12$ ansible -m ping web-host1 ## Specific host $ ansible -m ping webservers ## Specific group 1$ ansible -m shell -a 'free -m' web-host1 source : https://tecadmin.net/install-ansible-on-ubuntu-16-04-xenial/","link":"/2019/06/28/instalasi-ansible/"},{"title":"network-scanning","text":"","link":"/2018/08/30/network-scanning/"},{"title":"pengenalan-linux","text":"Apakah Linux itu ?Linux adalah nama sebuah sistem operasi (operating system) untuk PC yang bekerja secara Multitasking dan MultiUser. Linux bekerja secara multi tasking artinya dapat menjalankan beberapa aplikasi secara bersamaan, misalnya dapat bermain game sambil melakukan download dari internet. Linux bekerja secara Multiuser artinya Linux mendukung penggunaan aplikasi atau computer untuk melayani beberapa user sekaligus, misalnya sebuah program dapat digunakan bersama-sama pada jaringan network. Linux sebenarnya adalah tiruan (clone) dari UNIX yang dirancang untuk dijalankan pada PC. Berbicara tentang UNIX, pada dasarnya sistem operasi ini bersifat portable (tidak tergantung pada perangkat keras tertentu) sehingga dapat digunakan mulai dari platform notebook hingga supercomputer. Demikian pula halnya Linux, sistem operasi ini sudah sangat popular dan banyak diminati para professional. Di sisi lain UNIX adalah sistem operasi komersial yang mahal. Pada awalnya UNIX diciptakan untuk computer besar seperti Mainframe dan supercomputer. Versi UNIX untuk PC merupakan modifikasi lanjutan dari versi aslinya. Karena itu versi UNIX untuk PC biasanya membutuhkan spesifikasi computer yang besar dan momboroskan ruang harddisk, sehingga UNIX kurang efisien untuk PC. Hal ini yang membuat tiruan UNIX untuk platform PC , diantaranya Minix dan Linux. Sebagai sistem operasi, Linux memiliki berbagai keunikan dan kelebihan yang tidak dimiliki sistem operasi lainnya. Dan yang paling khas ialah Linux merupakan Free software. Perkembangan sejarah dan Versi LinuxNama Linux sendiri diturunkan dari pencipta awalnya, Linus Torvalds, yang sebetulnya mengacu pada suatu kumpulan software lengkap yang bersama-sama dengan kernel menyusun suatu sistem operasi yang lengkap. Linus Torvalds terinspirasi oleh diciptakannya minix - sistem tiruan UNIX sederhana yang dibuat Andy tanenbaum.Lingkungan sistem operasi Linux mencakup ratusan program, termasuk kompiler, interpreter, editor dan utilitas. Perangkat bantu yang mendukung konektifitas, ethernet, SLIP dan PPP dan interoperabilitas. Produk perangkat lunak yang handal (reliable), termasuk versi pengembangan terakhir. Kelompok pengembang yang tersebar di seluruh dunia yang telah bekerja dan menjadikan Linux portabel ke suatu platform baru, begitu juga mendukung komunitas pengguna yang memiliki beragam kebutuhan dan juga pengguna dapat turut serta bertindak sebagai tim pengembang sendiri.Perkembangan versi Linux :Versi pertama Linux 0.10 pertama kali dipublikasikan pada November 1991Kemudian diterbitkan versi 0.11 pada desember 1991Pada versi 0.13 Linux sudah lebih stabil dan Linuz memutuskan mengubah versinya menjadi versi 0.95Kini Linux terus berkembang secara cepat karena Source code sistem operasi ini disebarluaskan dan dapat dimodifikasi serta dikembangkan oleh siapa saja. Perbedaan mendasar LinuxSatu hal yang membedakan Linux terhadap sistem operasi lainnya adalah harga. Linux ini lebih murah dan dapat diperbanyak serta didistribusikan kembali tanpa harus membayar fee atau royalti kepada seseorang. Tetapi ada hal lain yang lebih utama selain pertimbangan harga yaitu mengenai source code. Source code Linux tersedia bagi semuaorang sehingga setiap orang dapat terlibat langsung dalam pengembangannya. Kebebasan ini telah memungkinkan para vendor perangkat keras membuat driver untuk device tertentu tanpa harus mendapatkan lisensi source code yang mahal atau menandatangani Non Disclosure Agreement (NDA). Dan itu juga telah menyediakan kemungkinan bagi setiap orang untuk melihat ke dalam suatu sistem operasi yang nyata dan berkualitas komersial. Karena Linux itu tersedia secara bebas di internet, berbagai vendor telah membuat suatu paket distrbusi yang dapat dianggap sebagai versi kemasan Linux. Paket ini termasuk lingkungan Linux lengkap, perangkat lunak untuk instalasi dan mungkin termasuk perangkat lunak khusus dan dukungan khusus. Perbandingan Linux terhadap sistem operasi lainnyaLinux disusun berdasarkan standar sistem operasi POSIX yang sebenarnya diturunkan berdasarkan fungsi kerja UNIX. UNIX kompatibel dengan Linux pada level system call, ini berarti sebagian besar program yang ditulis untuk UNIX atau Linux dapat direkompilasi dan dijalankan pada sistem lain dengan perubahan yang minimal. Secara umum dapat dikatakan Linux berjalan lebih cepat dibanding UNIX lain pada hardware yang sama. Dan lagi UNIX memiliki kelemahan yaitu tidak bersifat free.MS-DOS memiliki kemiripan dengan Linux yaitu file sistem yang bersifat hirarkis. Tetapi MS-DOS hanya dapat dijalankan pada prosesor x86 dan tidak mendukung multi user dan multi tasking, serta tidak bersifat free. Juga MSDOS tidak memiliki dukungan yang baik agar dapat berinteroperasi dengan sistem operasi lainnya, termasuk tidak tersedianya perangkat lunak network, program pengembang dan program utilitas yang ada dalam Linux. C Compiler menggunakan gcc dari Free Software Foundation GNU’s Project. Compiler ini banyak digunakan pada lingkungan Hewlett-Packard dan Sun. Sekarang ini, banyak aplikasi Linux yang dapat digunakan untuk keperluan kantor seperti untuk spreadsheet, word processor, database dan program editor grafis yang memiliki fungsi dan tampilan seperti Microsoft Office, yaitu Star Office. Selain itu, juga sudah tersedia versi Corel untuk Linux dan aplikasi seperti Matlab yang pada Linux dikenal sebagai Scilab. Linux bisa didapatkan dalam berbagai distribusi (sering disebut Distro). Distro adalah bundel dari kernel Linux, beserta sistem dasar linux, program instalasi, tools basic, dan program-program lain yang bermanfaat sesuai dengan tujuan pembuatan distro. Ada banyak sekali distro Linux, diantaranya :RedHat, distribusi yang paling populer, minimal di Indonesia. RedHat merupakan distribusi pertama yang instalasi dan pengoperasiannya mudah.Debian, distribusi yang mengutamakan kestabilan dan kehandalan, meskipun mengorbankan aspek kemudahan dan kemutakhiran program. Debian menggunakan .deb dalam paket instalasi programnya.Slackware, merupakan distribusi yang pernah merajai di dunia Linux. Hampir semua dokumentasi Linux disusun berdasarkan Slackware. Dua hal penting dari Slackware adalah bahwa semua isinya (kernel, library ataupun aplikasinya) adalah yang sudah teruji. Sehingga mungkin agak tua tapi yang pasti stabil. Yang kedua karena dia menganjurkan untuk menginstall dari source sehingga setiap program yang kita install teroptimasi dengan sistem kita. Ini alasannya dia tidak mau untuk menggunakan binary RPM dan sampai Slackware 4.0, ia tetap menggunakan libc5 bukan glibc2 seperti yang lain.SuSE, distribusi yang sangat terkenal dengan YaST (Yet another Setup Tools) untuk mengkonfigurasi sistem. SuSE merupakan distribusi pertama dimana instalasinya dapat menggunakan bahasa Indonesia.Mandrake, merupakan varian distro RedHat yang dioptimasi untuk pentium. Kalau komputer kita menggunakan pentium ke atas, umumnya Linux bisa jalan lebih cepat dengan Mandrake.WinLinux, distro yang dirancang untuk diinstall di atas partisi DOS (WIndows). Jadi untuk menjalankannya bisa di-klik dari Windows. WinLinux dibuat seakan-akan merupakan suatu program aplikasi under Windows. Dan masih banyak distro-distro lainnya yang telah tersedia maupun yang akan muncul. Kelebihan LinuxDi sini akan dijelaskan beberapa kelebihan dari sistem operasi Linux/UNIX dibandingkan dengan dengan sistem operasi yang lain. Dan berikut ini adalah beberapa fakta dari hal-hal yang menguntungkan dengan menggunakan program dan file-file Linux/UNIX : Pada dasarnya semua data tersimpan di dalam harddisk walau ada beberapa kondisi dimana data tersimpan di disket. Linux/UNIX memberikan beberapa proses spesial dimana terminal, printer dan device hardware lainnya dapat diakses seperti kita mengakses file yang tersimpan dalam harddisk atau disket. Ketika program dijalankan, program tersebut dijalankan dari harddisk ke dalam RAM dan setelah dijalankan akan dinamakan sebagai proses. Linux/UNIX menyediakan servis untuk membuat, memodifikasi program, proses dan file. Linux/UNIX mendukung struktur file yang bersifat hirarki. Linux/UNIX adalah salah satu sistem operasi yang termasuk ke dalam kelas sistem operasi yang dapat melakukan multitasking. Multitasking sendiri adalah keadaan dimana suatu sistem operasi dapat melakukan banyak kerjaan pada saat yang bersamaan. Selain multitasking, Linux/UNIX juga dapat mendukung multiuser. Yaitu sistem operasi yang pada saat bersamaan dapat digunakan oleh lebih dari satu user yang masuk ke dalam sistem. Bahkan untuk Linux juga mendukung untuk multiconsole dimana pada saat bersamaan di depan komputer langsung tanpa harus melalui jaringan dan memungkinkan lebih dari satu user masuk ke dakam sistem. Bagian sistem operasiSistem Operasi Linux/UNIX terdiri dari kernel, program sistem dan beberapa program aplikasi. Kernel merupakan inti dari sistem operasi yang mengatur penggunaan memori, piranti masukan keluaran, proses-proses, pemakaian file pada file system dan lain-lain. Kernel juga menyediakan sekumpulan layanan yang digunakan untuk mengakses kernel yang disebut system call. System call ini digunakan untuk mengimplementasikan berbagai layanan yang dibutuhkan oleh sistem operasi.Program sistem dan semua program-program lainnya yang berjalan di atas kernel disebut user mode. Perbedaan mendasar antara program sistem dan program aplikasi adalah program sistem dibutuhkan agar suatu sistem operasi dapat berjalan sedangkan program aplikasi adalah program yang dibutuhkan untuk menjalankan suatu aplikasi tertentu.Contoh : daemon merupakan program sistem dan pengolah kata (word processor) merupakan program aplikasi. Struktur perangkat lunak linux KernelKernel merupakan bagian yang terpenting dari sistem operasi linux, yang berfungsi sebagai pengontrol perangkat keras dan membentuk berbagai fungsi pada tingkat rendah. Kernel juga bertugas melayani tanggal, jam, manajemen file, pengawasan keamanan, penjadwalan proses, manajemen memori, manajemen sistem, dan penanganan kesalahan dan intrupsi. Kernel Linux terdiri dari beberapa bagian penting, seperti : manajemen proses, manajemen memori, hardware device drivers, file system drivers, manajemen jaringan dan lain-lain. Namun bagian yang terpenting ialah manajemen proses dan manajemen memori. Manajemen memori menangani daerah pemakaian memori, daerah swap, bagian-bagian kernel dan untuk buffer cache. Manajemen proses menangani pembuatan proses-proses dan penjadwalan proses. Pada bagian dasar kernel berisi hardware device ShellShell dapat dikatakan sebagai penerjemah dalam linux yang berfungsi untuk menyembatani antara pemakai dengan sistem, artinya pemakai cukup memberikan perintah dan shell akan menangani tindakan selanjutnya. Ada perintah built-in dan perintah eksternal, perintah built-in merupakan perintah internal yang dimilki oleh shell itu sendiri sedang perintah eksternal, adalah perintah diluar perintah internal shell itu sendiri. Perintah ini dapat berupa utilitas atau program aplikasi. Ada tiga jenis shell, antara lain bourne shell nama programnya adalah sh, C shell programnya bernama csh, dan Korn shell programnya bernama ksh. UtilitasUtilitas merupakan program-program kecil yang digunakan untuk melaksanakan tugas-tugas tertentu. Antara lain: untuk mengolah file dan direktori, editor, komunikasi dan jaringan, administrasi system, menganalisis kerja system dan lain-lain. Program aplikasiAdalah program yang siap dipakai oleh pemakai untuk memenuhi kebutuhannya sendiri. Program-program ini dibuat dengan bahasa pemograman tinggkat tinggi.","link":"/2018/09/25/pengenalan-linux/"},{"title":"web scraping menggunakan  BeautifulSoup python","text":"Assalamu’alaikum wr wb. selamat pagi temen - temen. semoga kalian dalam keadaan sehat wal afiat. kali ini kita akan membahas mengenai web scraping dengan menggunakan bahasa pemrogaman python. baik kita mulai artikel ini dengan pembahasan mengenai apa itu web scraping, Web scraping (panen web) adalah pengambilan sebuah dokumen semi-terstruktur dari internet, umumnya berupa halaman-halaman web dalam bahasa markup seperti HTML atau XHTML, dan menganalisis dokumen tersebut untuk diambil data tertentu dari halaman tersebut. Istilah gampangnya yaitu pengambilan konten atau sebagian data dari suatu situs web untuk penjelasan lebih detail temen-temen bisa membacanya disini Tahap pertama yang harus dilakukan supaya teman-teman dapat lebih jauh belajar web scraping adalah menggunakan library requests seperi contoh source code dibawah ini.123import requestspage = requests.get(\"http://dataquestio.github.io/web-scraping-pages/simple.html\")page respone yang didapat dari script di atas adalah seperti di bawah ini1&lt;Response [200]&gt; angka 200 menunjukan bahwa halaman berhasil didownload.untuk eksperimen lainnya bisa juga menggunakan page.content yang digunakan untuk menampilkan isi dari halaman yang didownload1page.content 12345678910b'&lt;!DOCTYPE html&gt;\\n&lt;html&gt;\\n &lt;head&gt;\\n &lt;title&gt;A simple example page&lt;/title&gt;\\n &lt;/head&gt;\\n &lt;body&gt;\\n &lt;p&gt;Here is some simple content for this page.&lt;/p&gt;\\n &lt;/body&gt;\\n&lt;/html&gt;' web scraping using BeautifulSoupPada artikel ini library yang kita gunakan adalah BeautifulSoup untuk melakukan web scraping pada contoh kasus blog saya https://abdullahainun.me.1234567891011121314import requestsfrom bs4 import BeautifulSoupimport pandas as pdpage = requests.get(\"https://abdullahainun.github.io\")soup = BeautifulSoup(page.content, 'html.parser')main = soup.find(id=\"main\")main_juduls = main.select(\".article-title\")juduls = [a.get_text() for a in main_juduls]href = [a.get('href') for a in main_juduls]dfBlog = pd.DataFrame({ \"judul\": juduls, \"link\" : href })print(dfBlog) jadi setelah kita mendapatkan text yang kita inginkan kita parsing datanya ke dataframe sehingga output yang didapatkan menjadi seperti ini :1234567891011 judul link0 Port Forwarding with iptables /2018/12/31/Port-Forwarding-with-iptables/1 Cara download file di google drive dengan comm... /2018/12/26/Cara-download-file-di-google-drive...2 Rangkuman Manajemen Perangkat Lunak /2018/12/20/Rangkuman-Manajemen-Perangkat-Lunak/3 Rangkuman manajemen Kepemimpinan /2018/12/20/Rangkuman-manajemen-Kepemimpinan/4 Kumpulan Materi /2018/12/18/Kumpulan-Materi-Pemrogaman-Visual/5 Hack RDP windows dengan RDPWrap /2018/12/18/Hack-RDP-windows-dengan-RDPWrapper/6 UAS - Keamanan Jaringan /2018/12/18/UAS-Keamanan-Jaringan/7 Cara berkomunikasi pada ssh tanpa password /2018/12/18/cara-berkomunikasi-tanpa-password/8 Sapaan dari yang punya blog :( /2018/12/18/Binggung-mau-nulis-apa/9 pengenalan-linux /2018/09/25/pengenalan-linux/ sekian untuk pembahasan web scraping kali ini, semoga bermanfaat. wassalamu’alaikum wr wb","link":"/2019/05/06/web-scraping-tutorial-python/"}],"tags":[{"name":"devops","slug":"devops","link":"/tags/devops/"},{"name":"ansible","slug":"ansible","link":"/tags/ansible/"},{"name":"keamanan-jaringan","slug":"keamanan-jaringan","link":"/tags/keamanan-jaringan/"},{"name":"git","slug":"git","link":"/tags/git/"},{"name":"git-submodule","slug":"git-submodule","link":"/tags/git-submodule/"},{"name":"docker","slug":"docker","link":"/tags/docker/"},{"name":"cloud computer","slug":"cloud-computer","link":"/tags/cloud-computer/"},{"name":"ubuntu","slug":"ubuntu","link":"/tags/ubuntu/"},{"name":"linux","slug":"linux","link":"/tags/linux/"},{"name":"port-forwarding","slug":"port-forwarding","link":"/tags/port-forwarding/"},{"name":"ssh-key-pair","slug":"ssh-key-pair","link":"/tags/ssh-key-pair/"},{"name":"ssh","slug":"ssh","link":"/tags/ssh/"},{"name":"linux-public-key","slug":"linux-public-key","link":"/tags/linux-public-key/"},{"name":"ssh-keygen","slug":"ssh-keygen","link":"/tags/ssh-keygen/"},{"name":"remote-tanpa-pasword","slug":"remote-tanpa-pasword","link":"/tags/remote-tanpa-pasword/"},{"name":"NetworkSecurity","slug":"NetworkSecurity","link":"/tags/NetworkSecurity/"},{"name":"Laporan Kuliah","slug":"Laporan-Kuliah","link":"/tags/Laporan-Kuliah/"},{"name":"instalasi ansible","slug":"instalasi-ansible","link":"/tags/instalasi-ansible/"},{"name":"web scraping","slug":"web-scraping","link":"/tags/web-scraping/"}],"categories":[{"name":"devops","slug":"devops","link":"/categories/devops/"},{"name":"Kuliah","slug":"Kuliah","link":"/categories/Kuliah/"},{"name":"kuliah","slug":"kuliah","link":"/categories/kuliah/"},{"name":"windows tutorial","slug":"windows-tutorial","link":"/categories/windows-tutorial/"},{"name":"linux","slug":"linux","link":"/categories/linux/"},{"name":"python","slug":"python","link":"/categories/python/"}]}